bookmark_api/app/controllers/bookmarks_controller.rb

SELECT "bookmarks".* FROM "bookmarks"
---
  def index
    @bookmarks = Bookmark.all

INSERT INTO "bookmarks" ("title", "content", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @bookmark = Bookmark.new(bookmark_params)

    if @bookmark.save

UPDATE "bookmarks" SET "title" = $1, "url" = $2, "updated_at" = $3 WHERE "bookmarks"."id" = $4  [["title", "yahoo "], ["url", "www.yahoo.com"], ["updated_at", "2019-10-12 21:50:47.052346"], ["id", 4]]
---
  def update
    if @bookmark.update(bookmark_params)

DELETE FROM "bookmarks" WHERE "bookmarks"."id" = $1  [["id", 3]]
---
  def destroy
    @bookmark.destroy

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_bookmark
      @bookmark = Bookmark.find(params[:id])